{
  "_num_labels": 5,
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "decoder_start_token_id": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PRODUCT",
    "2": "I-PRODUCT",
    "3": "B-PRICE",
    "4": "I-PRICE",
    "5": "B-PLACE",
    "6": "I-PLACE",
    "7": "B-PROMOTION",
    "8": "I-PROMOTION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-PLACE": 5,
    "B-PRICE": 3,
    "B-PRODUCT": 1,
    "B-PROMOTION": 7,
    "I-PLACE": 6,
    "I-PRICE": 4,
    "I-PRODUCT": 2,
    "I-PROMOTION": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "prefix": null,
  "pruned_heads": {},
  "task_specific_params": null,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.12.1",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": false,
  "vocab_size": 50000
}
